<a href="https://colab.research.google.com/github/manojgupta3051994/Data-Science-Hackathon-And-Competition/blob/master/LoanPrediction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [218]:
import numpy as np
import pandas as pd

In [219]:
data = pd.read_csv('loan_application.csv')

In [220]:
data.head()

  Application_ID Gender Married  ... Property_Area  Income Application_Status
0       LP001002   Male      No  ...         Urban  medium                  Y
1       LP001003   Male     Yes  ...         Rural  medium                  N
2       LP001005   Male     Yes  ...         Urban     low                  Y
3       LP001006   Male     Yes  ...         Urban     low                  Y
4       LP001008   Male      No  ...         Urban  medium                  Y

[5 rows x 10 columns]

In [221]:
data.drop('Application_ID',1,inplace=True)

In [222]:
data.describe(include='all').T

                   count unique        top freq  ...  25%  50%  75%  max
Gender               511      2       Male  420  ...  NaN  NaN  NaN  NaN
Married              511      2        Yes  331  ...  NaN  NaN  NaN  NaN
Dependents           511      4          0  294  ...  NaN  NaN  NaN  NaN
Education            511      2   Graduate  401  ...  NaN  NaN  NaN  NaN
Self_Employed        511      2         No  441  ...  NaN  NaN  NaN  NaN
Credit_History       511    NaN        NaN  NaN  ...    1    1    1    1
Property_Area        511      3  Semiurban  197  ...  NaN  NaN  NaN  NaN
Income               511      3        low  273  ...  NaN  NaN  NaN  NaN
Application_Status   511      2          Y  347  ...  NaN  NaN  NaN  NaN

[9 rows x 11 columns]

In [223]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 511 entries, 0 to 510
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Gender              511 non-null    object
 1   Married             511 non-null    object
 2   Dependents          511 non-null    object
 3   Education           511 non-null    object
 4   Self_Employed       511 non-null    object
 5   Credit_History      511 non-null    int64
 6   Property_Area       511 non-null    object
 7   Income              511 non-null    object
 8   Application_Status  511 non-null    object
dtypes: int64(1), object(8)
memory usage: 36.1+ KB

In [224]:
data.isnull().sum()

Gender                0
Married               0
Dependents            0
Education             0
Self_Employed         0
Credit_History        0
Property_Area         0
Income                0
Application_Status    0
dtype: int64

In [225]:
data['Dependents'] = data['Dependents'].apply(lambda x:x.strip()[0])

In [226]:
data

     Gender Married Dependents  ... Property_Area  Income  Application_Status
0      Male      No          0  ...         Urban  medium                   Y
1      Male     Yes          1  ...         Rural  medium                   N
2      Male     Yes          0  ...         Urban     low                   Y
3      Male     Yes          0  ...         Urban     low                   Y
4      Male      No          0  ...         Urban  medium                   Y
..      ...     ...        ...  ...           ...     ...                 ...
506  Female      No          0  ...         Rural     low                   Y
507    Male     Yes          3  ...         Rural  medium                   Y
508    Male     Yes          1  ...         Urban  medium                   Y
509    Male     Yes          2  ...         Urban  medium                   Y
510  Female      No          0  ...     Semiurban  medium                   N

[511 rows x 9 columns]

In [227]:
def data_transform(df):
  for i in df.columns:
    if df[i].dtypes == 'object':
      new_data = pd.get_dummies(df,drop_first=True)
  return new_data

In [228]:
data = data_transform(data)

In [ ]:
data

In [266]:
X = data.iloc[:,:-1]
y = data.iloc[:,-1]

In [267]:
from sklearn.model_selection import train_test_split

In [268]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.25)

In [269]:
from sklearn.ensemble import RandomForestClassifier

In [270]:
rf = RandomForestClassifier(class_weight='balanced')
rf.fit(X_train,y_train)
y_pred = rf.predict(X_test)

In [271]:
from sklearn.metrics import recall_score

In [272]:
score = recall_score(y_test,y_pred)

In [273]:
print(score)

0.8795180722891566

In [239]:
import pickle

In [ ]:
from sklearn.externals import joblib 
  
# Save the model as a pickle in a file 
joblib.dump(rf, 'filename.pkl')